system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0) //0
    (1 0 0) //1
    (1 1 0) //2
    (0 1 0) //3
    (1 -1 0) //4
    (2 -1 0) //5
    (2 0 0) //6
    (2 1 0) //7

    (0 0 0.1) //8
    (1 0 0.1) //9
    (1 1 0.1) //10
    (0 1 0.1) //11
    (1 -1 0.1) //12
    (2 -1 0.1) //13
    (2 0 0.1) //14
    (2 1 0.1) //15

);

blocks
(
    hex (0 1 2 3 8 9 10 11) (20 20 1) simpleGrading (1 1 1)
    hex (1 6 7 2 9 14 15 10) (20 20 1) simpleGrading (1 1 1)
    hex (4 5 6 1 12 13 14 9) (20 20 1) simpleGrading (1 1 1)
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 2 10 11)
            (2 7 15 10)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 11 8)
            (0 8 9 1)
            (1 4 12 9)
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (1 6 7 2)
            (4 5 6 1)

            (8 9 10 11)
            (9 14 15 10)
            (12 13 14 9)
        );
    }
);

// *****************************caesar_wiratama_2023************************ //
// ************************************************************************* //
